In [29]:
import pandas 
# df = 
pandas.Series([1,2,3,4], ["행1","행2","행3","행4"]).loc[ "행2" : "행4" ].drop("행4")
# .drop("행3")
# del df["행3"]
# df

행2    2
행3    3
dtype: int64

In [105]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd
arr = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
idx = ["행1","행2","행3"]
col = ["열1","열2","열3"]
df1 = pd.DataFrame(arr, idx, col)
df1

    열1  열2  열3
행1   1   2   3
행2   4   5   6
행3   7   8   9

In [3]:
df2 = pd.DataFrame(arr[1:], idx[1:], col)
df2

    열1  열2  열3
행2   4   5   6
행3   7   8   9

In [35]:
df1 + df2

      열1    열2    열3
행1   NaN   NaN   NaN
행2   8.0  10.0  12.0
행3  14.0  16.0  18.0

In [38]:
s = pd.Series(arr[:1], idx[:1])
s

행1    [1, 2, 3]
dtype: object

In [39]:
df1 + s

     열1   열2   열3   행1
행1  NaN  NaN  NaN  NaN
행2  NaN  NaN  NaN  NaN
행3  NaN  NaN  NaN  NaN

In [41]:
df1

    열1  열2  열3
행1   1   2   3
행2   4   5   6
행3   7   8   9

In [43]:
df1.loc["행1","열1"] + s.loc["행1"]

array([2, 3, 4])

In [45]:
df3 = pd.DataFrame(arr[:1], idx[:1], col)
df3

    열1  열2  열3
행1   1   2   3

In [46]:
df1 + df3

     열1   열2   열3
행1  2.0  4.0  6.0
행2  NaN  NaN  NaN
행3  NaN  NaN  NaN

In [13]:
arr

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [36]:
# arr1 = [
#     [2,3],
#     [5,6],
#     [8,9],
# ]
# arr1
arr = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
idx = ["행1","행2","행3"]
col = ["열1","열2","열3"]
# arr[:][:2]
for list in arr:
    list.pop(1)
col.pop(1)
df4 = pd.DataFrame(arr, idx, col)
df4

    열1  열3
행1   1   3
행2   4   6
행3   7   9

In [39]:
df1 + df4

    열1  열2  열3
행1   2 NaN   6
행2   8 NaN  12
행3  14 NaN  18

In [44]:
import pandas as pd
import numpy as np
a = np.random.randint(0,10,24).reshape(4,6)
l1 = ["가","나","다","라"]
l2 = ["A","B","C","D","E","F"]
df = pd.DataFrame(a, l1, l2)
df

   A  B  C  D  E  F
가  1  7  9  4  7  6
나  5  2  2  3  7  2
다  6  1  8  8  6  7
라  4  8  5  0  0  3

In [50]:
b = df[ ["A","C","E"] ]
df + b

    A   B   C   D   E   F
가   2 NaN  18 NaN  14 NaN
나  10 NaN   4 NaN  14 NaN
다  12 NaN  16 NaN  12 NaN
라   8 NaN  10 NaN   0 NaN

In [53]:
df.loc["나":"다"]

   A  B  C  D  E  F
나  5  2  2  3  7  2
다  6  1  8  8  6  7

In [62]:
# df.loc["나":"다","B":"C"]
# df.loc[["나","다"],["B","C"]]
df[ ["B", "C"] ][ "나":"다" ]

   B  C
나  2  2
다  1  8

In [73]:
b = df.iloc[:, 1:3]
print(b)
b.drop("B", axis=1) # 축이 1이면 열를 대상으로 삭제 처리 하나다. (기본값은 행 (0))

   B  C
가  7  9
나  2  2
다  1  8
라  8  5

   C
가  9
나  2
다  8
라  5

In [76]:
import pandas as pd
a1 = [60, 84, 80, 70, 19]
a2 = [77, 62, 95, 85, 17]
a3 = [61, 97, 72, 67, 15]
a4 = [75, 65, 95, 51, 18]
cols = ["국어", "영어", "수학", "과학", "나이"]
idx = ["A","B","C","D"]
df = pd.DataFrame([a1, a2, a3, a4], index=idx, columns=cols)
df

   국어  영어  수학  과학  나이
A  60  84  80  70  19
B  77  62  95  85  17
C  61  97  72  67  15
D  75  65  95  51  18

In [79]:
df.sort_values("영어", ascending=False)

   국어  영어  수학  과학  나이
C  61  97  72  67  15
A  60  84  80  70  19
D  75  65  95  51  18
B  77  62  95  85  17

In [81]:
df.sort_values(["영어","수학"], ascending=[1,0])

   국어  영어  수학  과학  나이
B  77  62  95  85  17
D  75  65  95  51  18
A  60  84  80  70  19
C  61  97  72  67  15

In [141]:
# Q1 위의 성적표에서 수학점수가 동률인 것만 출력하시오
d1 = df["수학"].sort_values(ascending=False)
cnt = d1.value_counts()
d1[d1 == cnt[cnt > 1].index[0]]

B    95
D    95
Name: 수학, dtype: int64

In [148]:
df1.add(df1)

    열1  열2  열3
행1   2   4   6
행2   8  10  12
행3  14  16  18

In [149]:
df1 + df1

    열1  열2  열3
행1   2   4   6
행2   8  10  12
행3  14  16  18

In [147]:
df2

    열1  열2  열3
행2   4   5   6
행3   7   8   9

In [151]:
df1.loc["행4"] = [10,11,12]

In [152]:
df1

    열1  열2  열3
행1   1   2   3
행2   4   5   6
행3   7   8   9
행4  10  11  12

In [157]:
arr = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
arr.append([10,11,12])
# arr[3] = [10,11,12]

In [164]:
df1.drop("행4", axis=0, inplace=True)
df1

    열1  열2  열3
행1   1   2   3
행2   4   5   6
행3   7   8   9